---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.FlowState
source: html/71a0301d-cff3-c411-5fcf-3bc9b3dacac6.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.FlowState Property

The flowState of the pipe.

## Syntax (C#)
```csharp
public PipeFlowState FlowState { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration